# 데이터 프레임 변수

## 1. 데이터 프레임 변수 유형

#### - 범주형 변수: 가감승제가 가능하지만 의미가 없다

#### - 연속형 변수: 사칙연산이 가능, 숫자들의 크기 차이 계산 가능

#### - 단일변수: 한 개 변수 분석 (범주형 분석, 연속형 분석)

## 2. 빈도 및 교차 데이터 만들기

In [4]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib.pylab as plt
import seaborn as sns

In [5]:
tips = sns.load_dataset('tips')

In [7]:
print(tips)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

### 2.1 빈도 분석

In [13]:
tips[['sex']]

        sex
0    Female
1      Male
2      Male
3      Male
4    Female
..      ...
239    Male
240  Female
241    Male
242    Male
243  Female

[244 rows x 1 columns]

In [18]:
tips[['sex']].value_counts()

sex
Male      157
Female     87
dtype: int64

In [19]:
tips[['day']].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
dtype: int64

In [22]:
tips[['smoker']].value_counts()

smoker
No        151
Yes        93
dtype: int64

In [23]:
tips[['time']].value_counts()

time
Dinner    176
Lunch      68
dtype: int64

In [24]:
tips[['size']].value_counts()

size
2       156
3        38
4        37
5         5
1         4
6         4
dtype: int64

### 2.2 교차분석

#### - 범주형 데이터

In [26]:
pd.crosstab(tips['sex'], tips['day'])

day     Thur  Fri  Sat  Sun
sex
Male      30   10   59   58
Female    32    9   28   18

In [27]:
pd.crosstab(tips['sex'], tips['day'], margins = True)

day     Thur  Fri  Sat  Sun  All
sex
Male      30   10   59   58  157
Female    32    9   28   18   87
All       62   19   87   76  244

In [32]:
pd.crosstab(tips['sex'], tips['day']).apply(lambda r : r / len(tips), axis = 1)

day         Thur       Fri       Sat       Sun
sex
Male    0.122951  0.040984  0.241803  0.237705
Female  0.131148  0.036885  0.114754  0.073770

#### - 연속형 데이터

In [36]:
tips.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [37]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [55]:
tips['sex_kor'] = 0

for i in range(len(tips)):
    
    if tips['sex'][i] == 'Male':
        tips['sex_kor'][i] = '남'
    else:
        tips['sex_kor'][i] = '여'

C:\Users\thdwo\AppData\Local\Temp/ipykernel_15196/779664299.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tips['sex_kor'][i] = '여'

In [51]:
tips['sex_kor']

0      여
1      남
2      남
3      남
4      여
      ..
239    남
240    여
241    남
242    남
243    여
Name: sex_kor, Length: 244, dtype: object

In [56]:
tips

     total_bill   tip     sex smoker   day    time  size sex_kor
0         16.99  1.01  Female     No   Sun  Dinner     2       여
1         10.34  1.66    Male     No   Sun  Dinner     3       남
2         21.01  3.50    Male     No   Sun  Dinner     3       남
3         23.68  3.31    Male     No   Sun  Dinner     2       남
4         24.59  3.61  Female     No   Sun  Dinner     4       여
..          ...   ...     ...    ...   ...     ...   ...     ...
239       29.03  5.92    Male     No   Sat  Dinner     3       남
240       27.18  2.00  Female    Yes   Sat  Dinner     2       여
241       22.67  2.00    Male    Yes   Sat  Dinner     2       남
242       17.82  1.75    Male     No   Sat  Dinner     2       남
243       18.78  3.00  Female     No  Thur  Dinner     2       여

[244 rows x 8 columns]